import styles from "@/module/ItemList.module.css"; // وارد کردن فایل استایل ماژول CSS برای این کامپوننت

/**
 * کامپوننت ItemList
 * این کامپوننت وظیفه دارد یک لیست از آیتم‌ها را نمایش دهد.
 * در صورتی که داده‌ای وجود نداشته باشد، یک پیام پیش‌فرض نمایش می‌دهد.
 *
 * @param {Object} props - پراپ‌های ورودی به کامپوننت
 * @param {Array<string>} props.data - آرایه‌ای از رشته‌ها برای نمایش به‌عنوان لیست
 *
 * @returns {JSX.Element} خروجی JSX که یک لیست یا پیام پیش‌فرض را نمایش می‌دهد
 */
function ItemList({ data }) {
  return (
    <div className={styles.container}>
      {/* بررسی می‌شود که آیا آرایه data دارای آیتم هست یا خیر */}
      {data.length ? (
        <ul>
          {/* در صورتی که داده‌ها موجود باشد، هر آیتم به‌صورت لیست (<li>) نمایش داده می‌شود */}
          {data.map((amenity, index) => (
            // استفاده از index به‌عنوان key برای شناسایی منحصر به فرد هر آیتم در لیست
            <li key={index}>{amenity}</li>
          ))}
        </ul>
      ) : (
        // در صورتی که آرایه خالی باشد، پیام پیش‌فرض نمایش داده می‌شود
        <p>هیچ موردی ذکر نشده است</p>
      )}
    </div>
  );
}

export default ItemList; // خروجی کامپوننت برای استفاده در سایر بخش‌های پروژه
